#+title: Solutions for SICP Exercises

** [[skim:///Users/dsdshcym/Dropbox/Docs/sicp.pdf::54][Exercise 1.1]]
   1. Question 1
      #+BEGIN_SRC scheme
        10
      #+END_SRC

      #+RESULTS:
      : 10

   2. Question 2
      #+BEGIN_SRC scheme
        (+ 5 3 4)
      #+END_SRC

      #+RESULTS:
      : 12

   3. Question 3
      #+BEGIN_SRC scheme
        (- 9 1)
      #+END_SRC

      #+RESULTS:
      : 8

   4. Question 4
      #+BEGIN_SRC scheme
        (/ 6 2)
      #+END_SRC

      #+RESULTS:
      : 3

   5. Question 5
      #+BEGIN_SRC scheme
        (+ (* 2 4) (- 4 6))
      #+END_SRC

      #+RESULTS:
      : 6

   6. Question 6
      #+BEGIN_SRC scheme :session
        (define a 3)
        (define b (+ a 1))
      #+END_SRC

      #+RESULTS:

   7. Question 7
      #+BEGIN_SRC scheme :session
        (+ a b (* a b))
      #+END_SRC

      #+RESULTS:
      : 19

   8. Question 8
      #+BEGIN_SRC scheme :session
        (= a b)
      #+END_SRC

   9. Question 9
      #+BEGIN_SRC scheme :session
        (if (and (> b a) (< b (* a b)))
            b
            a)
      #+END_SRC

      #+RESULTS:
      : 4

   10. Question 10
       #+BEGIN_SRC scheme :session
         (cond ((= a 4) 6)
               ((= b 4) (+ 6 7 a))
               (else 25))
       #+END_SRC

       #+RESULTS:
       : 16

   11. Question 11
       #+BEGIN_SRC scheme :session
         (+ 2 (if (> b a) b a))
       #+END_SRC

       #+RESULTS:
       : 6

   12. Question 12
       #+BEGIN_SRC scheme :session
         (* (cond ((> a b) a)
                 ((< a b) b)
                 (else -1))
           (+ a 1))
       #+END_SRC

       #+RESULTS:
       : 16
** [[skim:///Users/dsdshcym/Dropbox/Docs/sicp.pdf::55][Exercise 1.2]]
   #+BEGIN_SRC scheme
     (/ (+ (+ 5 4)
           (- 2 (- 3 (+ 6 (/ 4 5)))))
        (* (* 3
              (- 6 2))
           (- 2 7)))
   #+END_SRC

   #+RESULTS:
   : -37/150
** [[skim:///Users/dsdshcym/Dropbox/Docs/sicp.pdf::55][Exercise 1.3]]
   #+BEGIN_SRC scheme
     (define (sum-of-two-larger-squares a b c)
       (define (square x)
         (* x x))

       (define (sum a b)
         (+ a b))

       (define (larger a b)
         (if (> a b)
             a
             b))

       (define (largest-of-three a b c)
         (larger a (larger b c)))

       (define (smaller a b)
         (if (< a b)
             a
             b))

       (define (smallest-of-three a b c)
         (smaller a (smaller b c)))

       (define (is-middle a b c)
         (or (and (<= c b) (<= b a))
             (and (<= a b) (<= b c))))

       (define (middle-of-three a b c)
         (cond ((is-middle b a c) a)
               ((is-middle a b c) b)
               ((is-middle a c b) c)))

       (sum (square (largest-of-three a b c))
            (square (middle-of-three a b c)))
       )

     (sum-of-two-larger-squares 1 2 3)
     (sum-of-two-larger-squares 4 2 3)
   #+END_SRC

   #+RESULTS:
   : 25

** Exercise 1.10
   #+BEGIN_SRC scheme :session
     (define (A x y) (cond ((= y 0) 0)
                           ((= x 0) (* 2 y))
                           ((= y 1) 2)
                           (else (A (- x 1) (A x (- y 1))))))
   #+END_SRC

   #+RESULTS:

   - (A 1 10)
     #+BEGIN_SRC scheme :session :exports both
       (A 1 10)
     #+END_SRC

     #+RESULTS:
     : 1024

   - (A 2 4)
     #+BEGIN_SRC scheme :session :exports both
       (A 2 4)
     #+END_SRC

     #+RESULTS:
     : 65536

   - (A 3 3)
     #+BEGIN_SRC scheme :session :exports both
       (A 3 3)
     #+END_SRC

     #+RESULTS:
     : 65536

   - ~f~
     ~(f n)~ computes ~2 * n~.

   - ~g~
     ~(g n)~ computes ~2^n~

   - ~h~
     ~(h n)~ computes ~2^(h (- n 1))~
** Exercise 1.17
   #+BEGIN_SRC scheme :session
     (define (double a) (+ a a))

     (define (halve a) (/ a 2))

     (define (fast-mult a n)
       (cond ((= n 0) 0)
             ((even? n) (double (fast-mult a (halve n))))
             (else (+ a (fast-mult a (- n 1))))))

     (fast-mult 4 6)
   #+END_SRC

   #+RESULTS:
   : 24

** Exercise 1.18
   #+BEGIN_SRC scheme :session
     (define (fast-mult-iter a n product)
       (cond ((= n 0) product)
             ((even? n) (fast-mult-iter (double a) (halve n) product))
             (else (fast-mult-iter a (- n 1) (+ a product)))))

     (fast-mult-iter 4 6 0)
   #+END_SRC

   #+RESULTS:
   : 24
** [[skim:///Users/dsdshcym/Dropbox/Docs/sicp.pdf::109][Exercise 1.32]]
   - Helper Functions
     #+BEGIN_SRC scheme :session 1-32
       (define (identify x)
         x)

       (define (inc x)
         (+ x 1))
     #+END_SRC

     #+RESULTS:
   - Recursive
     #+BEGIN_SRC scheme :session 1-32
       (define (accumulate combiner null-value term a next b)
         (if (> a b)
             null-value
             (combiner (term a)
                       (accumulate combiner null-value term (next a) next b))))
     #+END_SRC

     #+RESULTS:

   - Iterative
     #+BEGIN_SRC scheme :session 1-32
       (define (accumulate combiner null-value term a next b)
         (define (iter a result)
           (if (> a b)
               result
               (iter (next a) (combiner result (term a)))))
         (iter a null-value))
     #+END_SRC

     #+RESULTS:

   - Test Functions
     - Sum
       #+BEGIN_SRC scheme :session 1-32
         (define (sum a b)
           (accumulate + 0 identity a inc b))

         (sum 1 21)
       #+END_SRC

       #+RESULTS:
       : 231

     - Product
       #+BEGIN_SRC scheme :session 1-32
         (define (product a b)
           (accumulate * 1 identity a inc b))

         (product 1 6)
       #+END_SRC

       #+RESULTS:
       : 720
** [[skim:///Users/dsdshcym/Dropbox/Docs/sicp.pdf::122][Exercise 1.36]]
   #+BEGIN_SRC scheme
     (define tolerance 0.00001)

     (define (fixed-point f first-guess)
       (define (close-enough? v1 v2)
         (< (abs (- v1 v2))
            tolerance))

       (define (try guess)
         (newline)
         (display guess)
         (let ((next (f guess)))
           (if (close-enough? guess next)
               next
               (try next))))

       (try first-guess))

     (fixed-point (lambda (x) (/ (log 1000) (log x)))
                  2.0)
   #+END_SRC

   #+RESULTS:
   : 4.555532270803653
** [[skim:///Users/dsdshcym/Dropbox/Docs/sicp.pdf::123][Exercise 1.37]]
   - Recursive
     #+BEGIN_SRC scheme :session
       (define (count-frac n d k)
         (define (recur i)
           (if (> i k)
               0
               (/ (n i) (+ (d i) (recur (+ i 1))))))
         (recur 1))

       (count-frac (lambda (i) 1.0)
                   (lambda (i) 1.0)
                   11)
     #+END_SRC

     #+RESULTS:
     : 0.6180555555555556

   - Iterative
     #+BEGIN_SRC scheme :session
       (define (count-frac n d k)
         (define (iter i result)
           (if (< i 1)
               result
               (iter (- i 1) (/ (n i) (+ (d i) result)))))
         (iter k 0))

       (define (frac k)
         (count-frac (lambda (i) 1.0)
                     (lambda (i) 1.0)
                     k))
       (frac 11)
     #+END_SRC

     #+RESULTS:
     : 0.6180555555555556
** [[skim:///Users/dsdshcym/Dropbox/Docs/sicp.pdf::124][Exercise 1.38]]
   #+BEGIN_SRC scheme :session
     (define (n i) 1.0)

     (define (k i)
       (if (= (modulo i 3) 2)
           (* 2 (/ (+ i 1) 3))
           1))

     (+ (count-frac n k 100) 2)
   #+END_SRC

   #+RESULTS:
   : 2.7182818284590455
